; Arabic
; Bob (Oman)
; Discord: 111a1

[Arabic]
IDS_TITLE_EXCLUDE=استبعاد
IDS_FILE=ملف
IDS_SETTINGS=الإعدادات
IDS_EXIT=خروج
IDS_EDIT=تحرير
IDS_PURGE_UNUSED=تنظيف التطبيقات غير المستخدمة
IDS_PURGE_TIMERS=تنظيف المؤقتات
IDS_FIND=بحث
IDS_REFRESH=تحديث
IDS_VIEW=عرض
IDS_ICONS=الرموز
IDS_ICONSSMALL=صغيرة
IDS_ICONSLARGE=كبيرة
IDS_ICONSISHIDDEN=عدم عرض الرموز
IDS_LANGUAGE=اللغة
IDS_FONT=الخط
IDS_HELP=مساعدة
IDS_WEBSITE=الموقع الإلكتروني
IDS_CHECKUPDATES=التحقق من التحديثات
IDS_DONATE=قل شكراً!
IDS_ABOUT=حول
IDS_TRAY_SHOW=إظهار/إخفاء
IDS_TRAY_START=تفعيل الفلاتر
IDS_TRAY_STOP=إلغاء تفعيل الفلاتر
IDS_TRAY_RULES=القواعد
IDS_TRAY_BLOCKLIST_RULES=قائمة الحظر
IDS_TRAY_SYSTEM_RULES=قواعد نظام التشغيل
IDS_TRAY_USER_RULES=قواعد المستخدم
IDS_TRAY_LOGERR=سجل الأخطاء
IDS_ADD_FILE=إضافة تطبيق
IDS_ANY=أي
IDS_DISABLENOTIFICATIONS=إلغاء تنشيط الإشعارات
IDS_OPENRULESEDITOR=إنشاء قاعدة
IDS_TIMER=مؤقت
IDS_DISABLETIMER=إلغاء تنشيط المؤقت
IDS_EXPLORE=فتح موقع الملف
IDS_COPY=نسخ
IDS_SELECT_ALL=تحديد الكل
IDS_CHECK=السماح بالتحديد
IDS_UNCHECK=حظر التحديد
IDS_ADD=إضافة
IDS_EDIT2=تعديل
IDS_DELETE=حذف
IDS_EXPORT=تصدير
IDS_IMPORT=استيراد
IDS_RULE_ALLOWLOOPBACK=السماح بكل حركة المرور الخاصة بالتكرار (loopback)
IDS_HIGHLIGHT_INVALID=غير صالح (الملف مفقود أو مشكلة في الفلتر)
IDS_HIGHLIGHT_NETWORK=تطبيق الشبكة المشتركة
IDS_HIGHLIGHT_PICO=تطبيق بيكو
IDS_HIGHLIGHT_SIGNED=تطبيق موقّع
IDS_HIGHLIGHT_SILENT=الإشعارات معطلة
IDS_HIGHLIGHT_SPECIAL=قواعد المستخدم
IDS_HIGHLIGHT_SYSTEM=تطبيق نظام التشغيل
IDS_GROUP_TIMER=تطبيقات تحتوي على مؤقت
IDS_EDITOR=محرر القواعد
IDS_NAME=الاسم
IDS_RULE=القاعدة
IDS_PORTVERSION=العائلة (المنافذ فقط)
IDS_PROTOCOL=البروتوكول
IDS_DIRECTION=Direction
IDS_ACTION=Action
IDS_DATE=Date
IDS_FILEPATH=المسار
IDS_SIGNATURE=Signature
IDS_ADDRESS=العنوان
IDS_FILTER=الفلتر
IDS_NOTES=Notes
IDS_ADDED=تمت الإضافة
IDS_TIMELEFT=الوقت المتبقي
IDS_SIGN_SIGNED=موقع
IDS_SIGN_UNSIGNED=غير موقّع
IDS_GROUP_ALLOWED=تطبيقات ذات وصول إلى الشبكة
IDS_GROUP_BLOCKED=تطبيقات بدون وصول إلى الشبكة
IDS_GROUP_ENABLED=القواعد مفعلة
IDS_GROUP_DISABLED=القواعد غير مفعلة
IDS_DIRECTION_1=صادر
IDS_DIRECTION_2=وارد
IDS_DIRECTION_3=كلاهما
IDS_ACTION_ALLOW=السماح
IDS_ACTION_BLOCK=حظر
IDS_ENABLE_CHK=تفعيل القاعدة
IDS_WIKI=مساعدة
IDS_SAVE=حفظ
IDS_CLOSE=إغلاق
IDS_SETTINGS_GENERAL=عام
IDS_TITLE_GENERAL=الإعدادات العامة
IDS_TITLE_LANGUAGE=اللغة
IDS_TITLE_CONFIRMATIONS=Confirmations
IDS_TITLE_INTERFACE=Interface
IDS_TITLE_HIGHLIGHTING=التظليل
IDS_TITLE_LOGGING=سجل الحزم
IDS_TITLE_NOTIFICATIONS=Notifications
IDS_TITLE_ADVANCED=متقدم
IDS_ALWAYSONTOP_CHK=دائمًا مرئي
IDS_LOADONSTARTUP_CHK=التحميل عند بدء تشغيل النظام
IDS_STARTMINIMIZED_CHK=تشغيل في الوضع المصغر
IDS_SHOWFILENAMESONLY_CHK=عرض أسماء الملفات فقط
IDS_AUTOSIZECOLUMNS_CHK=الحجم التلقائي للأعمدة
IDS_SKIPUACWARNING_CHK=تجاهل تحذير "التحقق من حساب المستخدم"
IDS_CHECKUPDATES_CHK=التحقق التلقائي من التحديثات (موصى به)
IDS_LANGUAGE_HINT=اختيار اللغة:
IDS_USESTEALTHMODE_CHK=منع فحص المنافذ
IDS_USESTEALTHMODE_HINT=منع فحص المنافذ TCP عن طريق إسقاط فحص المنافذ TCP و RST و UDP الواردة، والرد على ICMP الصادرة مع "الوجهة غير قابلة للوصول".
IDS_INSTALLBOOTTIMEFILTERS_CHK=تفعيل الفلاتر عند بدء التشغيل
IDS_INSTALLBOOTTIMEFILTERS_HINT=منع تسرب البيانات عند بدء تشغيل النظام، حتى قبل بدء خدمة "محرك الفلترة الأساسي" (BFE).
IDS_USECERTIFICATES_CHK=التحقق من التوقيعات الرقمية للتطبيقات
IDS_USENETWORKRESOLUTION_CHK=حل العناوين الشبكية
IDS_DISABLEWINDOWSFIREWALL_CHK=إلغاء تفعيل جدار الحماية لويندوز
IDS_ENABLEWINDOWSFIREWALL_CHK=تفعيل جدار الحماية لويندوز
IDS_CONFIRMEXIT_CHK=التأكيد عند الإغلاق
IDS_CONFIRMEXITTIMER_CHK=التأكيد عند الإغلاق إذا كانت المؤقتات نشطة
IDS_CONFIRMLOGCLEAR_CHK=التأكيد عند مسح سجل الملفات
IDS_COLORS_HINT=انقر مرتين على عنصر لتعديله.
IDS_ENABLELOG_CHK=تفعيل تسجيل الحزم في ملف
IDS_LOGSHOW=عرض السجل
IDS_LOGCLEAR=مسح السجل
IDS_LOGSIZELIMIT_HINT=الحجم الأقصى للسجل: (ك.ب)
IDS_ENABLENOTIFICATIONS_CHK=تفعيل إشعارات الحزم
IDS_NOTIFICATIONSOUND_CHK=تفعيل الإشعارات الصوتية
IDS_NOTIFICATIONTIMEOUT_HINT=مدة العرض بين الإشعارات المتشابهة (ثواني):
IDS_NOTIFY_TOOLTIP=تحديد قاعدة للمستخدم للسماح لتطبيق بالوصول إلى عنوان أو منفذ
IDS_QUESTION=هل أنت متأكد؟
IDS_QUESTION_DELETE=حذف العنصر/العناصر المحددة؟
IDS_QUESTION_START=حظر الوصول إلى الشبكة للتطبيقات بناءً على الإعدادات الحالية. الاستمرار؟
IDS_QUESTION_STOP=استعادة الوصول إلى الشبكة لجميع التطبيقات المحجوبة حاليًا. الاستمرار؟
IDS_QUESTION_EXIT=الفلاتر المثبتة ستظل مفعلة حتى إذا غادرت. الاستمرار؟
IDS_QUESTION_TIMER=المؤقت/المؤقتات نشطة. المؤقتات تكون نشطة فقط عندما يتم تشغيل التطبيق. هل تريد الخروج؟
IDS_QUESTION_TIMERS=حذف جميع المؤقتات؟
IDS_QUESTION_FLAG_CHK=عدم السؤال مرة أخرى
IDS_STATUS_EMPTY=فارغ.
IDS_STATUS_SYNTAX_ERROR=خطأ في الصيغة في القاعدة!
IDS_ADDRESS_LOCAL=Source
IDS_ADDRESS_REMOTE=Destination
IDS_UPDATE_ERROR=خطأ في الاتصال بخادم التحديثات.
IDS_UPDATE_DOWNLOAD=تحميل التحديث...
IDS_UPDATE_DONE=تم تحميل التحديث.
IDS_GROUP_SPECIAL_APPS=تطبيقات تحتوي على قواعد المستخدم
IDS_RULE_ALLOWLOOPBACK_HINT=السماح بكل حركة المرور الخاصة بالتكرار (loopback).
IDS_RESET=إعادة تعيين
IDS_EXCLUDESTEALTH_CHK=فحص المنافذ
IDS_EXCLUDEBLOCKLIST_CHK=قائمة الحظر
IDS_UPDATE_INIT=التحقق من وجود نسخة جديدة...
IDS_UPDATE_INSTALL=تحديث متاح. هل ترغب في تثبيته الآن؟
IDS_EXCLUDECUSTOM_CHK=قواعد المستخدم
IDS_EXCLUDECLASSIFYALLOW_CHK=الاتصالات المسموح بها
IDS_STATUS_TIMER_DONE=انتهت مدة المؤقت لهذا التطبيق
IDS_ICONSEXTRALARGE=كبير جدًا
IDS_STATUS_UNUSED_APPS=تطبيقات غير مستخدمة
IDS_STATUS_TIMER_APPS=تطبيقات تحتوي على مؤقت
IDS_SECUREFILTERS_CHK=تفعيل حماية الفلاتر المثبتة
IDS_SECUREFILTERS_HINT=منع التطبيقات غير المصرح لها من الوصول إلى الفلاتر المثبتة.
IDS_USEREFRESHDEVICES_CHK=تحديث الفلاتر عند توصيل الأجهزة (التخزين)
IDS_RULE_ALLOW6TO4=السماح بكل إعادة توجيه IPv6 (6to4)
IDS_RECOMMENDED=موصى به
IDS_ICONSISTABLEVIEW=عرض كجدول
IDS_ACTION_ALLOW_HINT=السماح بالوصول إلى الشبكة إلى الأبد
IDS_ACTION_BLOCK_HINT=حظر الوصول إلى الشبكة إلى الأبد (إلى الأبد)
IDS_ACTION_LATER_HINT=تجاهل واطلب مني لاحقًا
IDS_RULE_APPLY_2=تطبيق القاعدة "%s" على هذا التطبيق
IDS_EDITRULES=تعديل القواعد
IDS_TAB_APPS=تطبيقات
IDS_TAB_SERVICES=Services
IDS_TAB_PACKAGES=تطبيقات UWP
IDS_TAB_NETWORK=الاتصالات
IDS_STATE=الحالة
IDS_STATUS_FILTERS_ACTIVE=الفلاتر مفعلة.
IDS_STATUS_FILTERS_INACTIVE=الفلاتر معطلة!
IDS_STATUS_FILTERS_PROCESSING=تطبيق الفلاتر
IDS_HIGHLIGHT_CONNECTION=متصل بالشبكة
IDS_SHOWINLIST=عرض في القائمة
IDS_BLOCKLIST_SPY=التجسس والقياسات من مايكروسوفت
IDS_BLOCKLIST_UPDATE=تحديثات مايكروسوفت
IDS_BLOCKLIST_EXTRA=تطبيقات مايكروسوفت
IDS_PORT=Port
IDS_NOTIFY_TITLE=تنبيه الشبكة
IDS_NOTIFY_HEADER=تم حظر الاتصال بالشبكة
IDS_DISABLE=إلغاء التفعيل
IDS_TITLE_SECURITY=الأمان
IDS_LOGVIEWER_HINT=تطبيق مشاهدة السجلات
IDS_NOTIFICATIONONTRAY_CHK=عرض الإشعارات في أسفل يمين الشاشة
IDS_NETWORK_CLOSE=إنهاء الاتصال
IDS_RULE_BLOCKOUTBOUND=حظر كل الحركة الصادرة
IDS_RULE_BLOCKINBOUND=حظر كل الحركة الواردة
IDS_VIEW_ICON=الرموز
IDS_VIEW_DETAILS=التفاصيل
IDS_VIEW_TILE=البلاطات
IDS_RULE_HINT=إذا تركت الحقول فارغة، فسيتم تطبيق القاعدة على جميع العناوين والمنافذ.
IDS_RULE_APPS_HINT=إذا لم يتم تحديد أي تطبيق، فسيتم تطبيق القاعدة على جميع التطبيقات.
IDS_STATUS_FILTERS_ACTIVE_TEMP=الفلاتر مفعلة حتى إعادة التشغيل التالي.
IDS_INSTALL_PERMANENT=القواعد الدائمة. هذه القواعد مفعلة حتى يتم تعطيلها يدويًا.
IDS_INSTALL_TEMPORARY=القواعد المؤقتة. سيتم تعطيل هذه القواعد بعد إعادة التشغيل التالي.
IDS_ENABLEUILOG_CHK=تفعيل واجهة تسجيل الحزم
IDS_NOTIFICATIONFULLSCREENSILENTMODE_CHK=تفعيل الوضع الصامت عندما يكون التطبيق في وضع ملء الشاشة
IDS_TITLE_TRAY=رمز في منطقة الإشعارات
IDS_TRAYICONSINGLECLICK_CHK=فتح بنقرة واحدة على الرمز في منطقة الإشعارات
IDS_ENABLE_APP_CHK=السماح بالوصول إلى الشبكة
IDS_APP_HINT=لا يوجد سبب لتحديد قاعدة تيسيرية لتطبيق لديه وصول كامل إلى الشبكة بالفعل.
IDS_HOST=المضيف
IDS_CONFIRMALLOW_CHK=التأكيد عند السماح لتطبيق
IDS_QUESTION_ALLOW=هل أنت متأكد أنك تريد منح هذا التطبيق وصولاً كاملاً إلى الشبكة؟
IDS_SHOWSEARCHBAR_CHK=عرض شريط البحث
IDS_LAYER=الطبقة
IDS_RULE_ALLOWWINDOWSUPDATE=السماح بتحديثات ويندوز
IDS_ACTION_TERMINATE_HINT=إيقاف العملية
IDS_PROFILE_TYPE=نوع الملف
IDS_USEAPPMONITOR_CHK=مراقبة تغييرات التطبيقات
IDS_DISABLEREMOVAL=منع الحذف
IDS_USEHASHES_CHK=التحقق من قيم التحقق من التطبيقات SHA-256
IDS_COMMENT=التعليقات
IDS_USEDARKTHEME=تفعيل الوضع الداكن
IDS_KEEPUNUSED_CHK=احتفظ بالتطبيقات غير المستخدمة
IDS_UPDATE_NO=لا يوجد تحديث متاح.
IDS_UPDATE_YES=تحديث متاح. هل ترغب في تنزيله وتثبيته الآن؟
IDS_UPDATE_SPEED=Speed
IDS_RULE_FOR_ALL=for all
IDS_RULE_FOR_APPS=for apps
IDS_PROFILE_TYPE_PLAIN=Plain
IDS_PROFILE_TYPE_COMPRESSED=Compressed
IDS_PROFILE_TYPE_ENCRYPTED=Encrypted
IDS_SESSION_ONLY=session only
IDS_LIMIT_REACHED=Limit reached.
IDS_INTERNAL_RULE=Internal rule
IDS_LOADING=Loading...
IDS_DIRECTION_REMOTE=Remote
IDS_DIRECTION_LOCAL=Local
IDS_WARNING_UNEXPECTED=Be careful, through service/driver host (svchost.exe/System) internet traffic can let out through unexpected ways. Continue?
IDS_WARNING_ME=If you disallow main process, you cannot use resolve network addresses option. Continue?
IDS_TOTAL=Total
IDS_EXCLUDEINBOUND_CHK=inbound multicast/broadcast
IDS_CONNECTIONS_ENABLE=Enable connections monitoring
IDS_CONNECTIONS_SHOWAITCONNECTIONS=Show waiting connections
IDS_CONNECTIONS_MEAUSUREUDPTRAFFIC=Measure UDP/QUIC traffic (experimental, restart required)
IDS_UDP_ACCOUNTING=UDP (including QUIC): ETW bytes since this socket was first monitored.
IDS_UDP_UNAVAILABLE=UDP measurement unavailable or incomplete. Restart simplewall to retry. Error
IDS_UDP_PENDING=UDP: no verified measurement yet. Sockets opened before monitoring must be reopened.
